Autodesk.Revit.DB.FormaRoad.ClampPolylinesToClampedMeshes(System.Collections.Generic.IList{Autodesk.Revit.DB.FormaRoadPolylineClampGroup})
Drapes open 2D polylines onto one or more road surface meshes. Each group pairs a set of
polylines with one FormaTriangleMesh. The returned outer array aligns with `groups`:
result[i] is the flat LINE LIST (consecutive XYZ pairs per segment) for groups[i].
Returns:
Empty outer array on total failure (DBG_WARN issued). Inner arrays may be empty when
a group produced no geometry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.FormaRoad.ClampRegionsToTerrain(Autodesk.Revit.DB.FormaRoadRegions,System.Collections.Generic.IList{Autodesk.Revit.DB.FormaTriangleMesh})
Projects per-road footprint regions onto a 3D terrain mesh and triangulates each
to a terrain-conforming 3D mesh. For every region the boundary is intersected with
the terrain (parts outside the terrain extent are clipped), boundary edges are
subdivided at terrain-triangle-edge crossings, boundary points and crossings are
elevated onto the terrain surface, terrain vertices inside the region are collected
as interior points, and the whole set is triangulated (Z carried from the elevated
points). Returns one mesh per region slot in roadRegions (aligned with regionStarts).
roadRegions:
Per-road footprint polygons (outer loop + optional holes per region).
terrainMeshes:
Target terrain, already scaled to feet (XY and Z).
Returns:
One entry per region index; null where that region produced no geometry. Empty array
on total failure (a DBG_WARN is issued).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.FormaRoad.TriangulatePlanarRegion(System.Collections.Generic.IList{Autodesk.Revit.DB.UV},System.Collections.Generic.IList{System.Collections.Generic.IList{System.Int32}})
Constrained Delaunay triangulation of a planar region defined by closed
boundary loops, optionally including pre-supplied interior Steiner points
in `vertices`. Wraps GeomUtil's
DelaunayTriangulation::triangulatePlanarRegion. The first loop is the
outer contour; remaining loops are holes. Triangle may append additional
Steiner points for refinement; the returned result reflects the final
(possibly extended) vertex pool.
vertices:
Vertex pool - boundary vertices plus any pre-supplied interior Steiner
points. Loop indices below refer to this array.
loops:
Boundary loops as index sequences into `vertices`. loops[0] is the
outer contour; loops[1..] are holes.
Returns:
Caller owns the returned object. Returns null on triangulation failure
(a DBG_WARN is also issued).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.FormaRoad.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FormaRoad.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
constructor for Forma road
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.FormaRoad
Forma road data used to create subdivsion
Since:
2027